Configuration_project_01/src/Documents/АЭС_ТоварныеПредложения/АЭС_ТоварныеПредложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АЭС_ТоварныеПредложения</name>
  <registerRecords>InformationRegister.АЭС_ТорговыеПредложения</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеСКлиентом</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.АЭС_ВидТорговогоПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРеквизит1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноИзменять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеактивироватьТорговоеПредложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration_project_01/src/Enums/АЭС_ВидТорговогоПредложения/АЭС_ВидТорговогоПредложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АЭС_ВидТорговогоПредложения</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Атом</name>
  </enumValues>
  <enumValues>
    <name>Консигнация</name>
  </enumValues>
</mdclass:Enum>

Configuration_project_01/src/Documents/АЭС_ТоварныеПредложения/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Поставщик	= (Объект.ТипОперации	= Перечисления.АЭС_ВидТорговогоПредложения.Поставщик);
	Консигнация	= (Объект.ТипОперации	= Перечисления.АЭС_ВидТорговогоПредложения.Консигнация);
	Атом		= (Объект.ТипОперации	= Перечисления.АЭС_ВидТорговогоПредложения.Атом);
	
	Элементы.Контрагент.Видимость				= НЕ Атом;
	Элементы.т_НоменклатураПоставщика.Видимость	= Поставщик;
	Элементы.БизнесРегион.Видимость				= НЕ Поставщик;
	
	Элементы.ГруппаСтраницы.ТолькоПросмотр	= Объект.ЗапрещеноИзменять;
		
КонецПроцедуры // Процедура УстановитьВидимостьДоступность()	

&НаСервере
Процедура ЗаполнитьТоварыНаСервере(ТипЗаполнения)
		
	Товары	= Документы.АЭС_ТоварныеПредложения.ЗаполнитьТовары(ТипЗаполнения,Объект.ТипОперации,Объект.Организация,Объект.Контрагент,Объект.Дата,Объект.БизнесРегион);
	
	Объект.Товары.Загрузить(Товары);
	
КонецПроцедуры // Процедура ЗаполнитьТоварыНаСервере(ТипЗаполнения)

&НаКлиенте
Процедура ЗаполнитьТовары(ТипЗаполнения)
	
	Если Объект.Товары.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект,ТипЗаполнения), НСтр("ru = 'Перед заполнением список товаров будет очищен. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли; // Если Объект.Товары.Количество() > 0 Тогда
	
	ЗаполнитьТоварыНаСервере(ТипЗаполнения);
	
КонецПроцедуры // Процедура ЗаполнитьТовары(ТипЗаполнения)

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Объект.Товары.Очистить();
    Иначе
        Возврат;
    КонецЕсли; // Если Ответ = КодВозвратаДиалога.Да Тогда
	
	ЗаполнитьТоварыНаСервере(ДополнительныеПараметры);

КонецПроцедуры // Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	УстановитьВидимостьДоступность();	
	
КонецПроцедуры // Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

&НаКлиенте
Процедура ВидТорговогоПредложенияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры // Процедура ВидТорговогоПредложенияПриИзменении(Элемент)

&НаКлиенте
Процедура ЗполнитьПоТипуОперации(Команда)
	
	ЗаполнитьТовары("1")	
	
КонецПроцедуры // Процедура ЗполнитьПоТипуОперации(Команда)

&НаКлиенте
Процедура ЗполнитьПоРегиону(Команда)
	
	ЗаполнитьТовары("2")	
	
КонецПроцедуры // Процедура ЗполнитьПоРегиону(Команда)

&НаКлиенте
Процедура ЗаполнитьПоМатрице(Команда)
	
	ЗаполнитьТовары("3")	
	
КонецПроцедуры // Процедура ЗаполнитьПоМатрице(Команда)
